# Q1. What is a database? Differentiate between SQL and NoSQL databases.

## Answer:

A database is a collection of organized data that is stored and managed on a computer system. It allows for efficient storage, retrieval, and manipulation of large amounts of data. A database system typically consists of software that manages the data, a database server that stores the data, and one or more applications that access the data.

SQL (Structured Query Language) and NoSQL (Not only SQL) are two different types of database management systems that use different methods for storing and retrieving data. Here are some key differences between the two:

|      Feature   | SQL databases                              | NoSQL databases                    |
| :---------:    | :----------------------------------------  | :--------------------------------  |
| Data model     | Relational data model                      | Flexible data model                |
| Query language | SQL                                        | Database-specific query language   |
| Scalability    | Vertically scalable                        | Horizontally scalable              |
| Consistency    | Strong consistency                         | May offer weaker consistency models|
| Usage          | Complex queries and transactions           | Fast and flexible data processing  |

Here are some examples of each databases:
1. SQL Databases:
    * mySQL
    * Oracle
    * PostgreSQL
    * Microsoft SQL Server
    * SQLite
2. NoSQL Databases:
    * MongoDB (document-oriented)
    * Cassandra (column-family)
    * Redis (key-value)
    * Neo4j (graph)
    * Amazon DynamoDB (document-oriented)


Similarly, there are many different types of SQL databases, each with their own features and benefits. For example, MySQL is a popular choice for web applications due to its fast performance and scalability, while PostgreSQL is often used for data warehousing and business intelligence applications due to its advanced query optimization capabilities.

Ultimately, the choice between SQL and NoSQL databases will depend on the specific requirements of your application and the type of data you need to store and process.

# Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example.

## Answer : DDL stands for Data Definition Language, which is a subset of SQL used to create, modify, and delete database objects such as tables, indexes, and views.

### Establishing Connection with SQLite3

#### Dependencies required : sqlalchemy==1.3.9 , ipython-sql
Using !pip install to install above package through this jupyter notebook

In [4]:
!pip install sqlalchemy==1.3.9 ipython-sql

Collecting sqlalchemy==1.3.9
  Downloading SQLAlchemy-1.3.9.tar.gz (6.0 MB)
     ---------------------------------------- 6.0/6.0 MB 7.6 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Requirement already satisfied: ipython-genutils in c:\users\neeraj\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
  Downloading ipython_sql-0.4.1-py3-none-any.whl (21 kB)
Collecting sqlparse
  Downloading sqlparse-0.4.4-py3-none-any.whl (41 kB)
     ---------------------------------------- 41.2/41.2 kB ? eta 0:00:00
Requirement already satisfied: six in c:\users\neeraj\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython>=1.0 in c:\users\neeraj\anaconda3\lib\site-packages (from ipython-sql) (8.10.0)
Collecting prettytable<1
  Downloading prettytable-0.7.2.zip (28 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.36)
Requirement already satisfied: pygments>=2.4.0 in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.11.2)
Requirement already satisfied: jedi>=0.16 in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: traitlets>=5 in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.7.1)
Requirement already satisfied: decorator in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: stack-data in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.6)
Requirement already satisfied: matplotlib-inline in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\neeraj\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\neeraj\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\neeraj\anaconda3\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.30->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: asttokens in c:\users\neeraj\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: executing in c:\users\neeraj\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in c:\users\neeraj\anaconda3\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Building wheels for collected packages: sqlalchemy, prettytable
  Building wheel for sqlalchemy (setup.py): started
  Building wheel for sqlalchemy (setup.py): finished with status 'done'
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.9-cp310-cp310-win_amd64.whl size=1142948 sha256=770413349f77444e83ca69e5aff06870d9eea3dc4a7ddbe8f9b81b0a85b15879
  Stored in directory: c:\users\neeraj\appdata\local\pip\cache\wheels\66\e3\30\28b647805efa547d8f190c0ea36dbce63a098cd732559acf2f
  Building wheel for prettytable (setup.py): started
  Building wheel for prettytable (setup.py): finished with status 'done'
  Created wheel for prettytable: filename=prettytable-0.7.2-py3-none-any.whl size=13705 sha256=30bf52742bfc339c15b74c7d99bfaf746357733c0edc78294a817e8a295dcb76
  Stored in directory: c:\users\neeraj\appdata\local\pip\cache\wheels\ec\32\b1\b9dda552a609c834467b28a174fa60d2c102e17857ccafd95b
Successfully built sqlalchemy prettytable
Installing collected packages: prettytable, sqlparse, sqlalchemy, ipython-sql
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.39
    Uninstalling SQLAlchemy-1.4.39:
      Successfully uninstalled SQLAlchemy-1.4.39
Successfully installed ipython-sql-0.4.1 prettytable-0.7.2 sqlalchemy-1.3.9 sqlparse-0.4.4

In [5]:
%load_ext sql

In [6]:
import csv, sqlite3
con = sqlite3.connect("test.db")
cur = con.cursor()

In [7]:
%sql sqlite:///test.db

### With above a connection is now established to test.db and we can directly write a query with %%sql magic command using above

Note: The %%sql command is a Jupyter Notebook magic command that allows you to execute SQL queries directly in a notebook cell. Provided that database connection is established

## Below are DDL Commands executed with %%sql magic cammand

1. CREATE: The CREATE command is used to create a new database object, such as a table, index, or view. For example, to create a new table called "users" with columns for a user's name, email, and password, you would use the following SQL statement:

In [11]:
%%sql
CREATE TABLE if not exists users
(id INT PRIMARY KEY,
name VARCHAR(50) NOT NULL,
email VARCHAR(50) NOT NULL,
password VARCHAR(50) NOT NULL);

 * sqlite:///test.db
Done.

[]

In [12]:
# Viewing Above table
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

2. DROP: The DROP command is used to delete an existing database object. For example, to delete the "users" table created in the previous example, you would use the following SQL statement:

In [14]:
# DROP example to delete tables
%sql DROP TABLE users;

 * sqlite:///test.db
Done.

[]

In [15]:
%sql SELECT * FROM users
#Below output shows that users table is deleted (no such table: users)

 * sqlite:///test.db
(sqlite3.OperationalError) no such table: users
[SQL: SELECT * FROM users]
(Background on this error at: http://sqlalche.me/e/e3q8)

3. ALTER: The ALTER command is used to modify an existing database object, such as a table, index, or view. For example, to add a new column to the "users" table to track a user's login status.

In [17]:
%%sql
CREATE TABLE if not exists users
(id INT PRIMARY KEY,
name VARCHAR(50) NOT NULL,
email VARCHAR(50) NOT NULL,
password VARCHAR(50) NOT NULL);

 * sqlite:///test.db
Done.

[]

In [18]:
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

In [19]:
%sql ALTER TABLE users ADD COLUMN login_status BOOLEAN;

 * sqlite:///test.db
Done.

[]

In [20]:
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

4. TRUNCATE: The TRUNCATE command is used to delete all the rows in a table, while keeping the table structure intact. For example, to delete all the data in the "users" table but keep the table structure, you would use the following SQL statement:

***Please note that SQLite has command : DELETE FROM table_name*** instead of TRUNCATE from mySQL

Command in my SQL is as below:<br>
TRUNCATE TABLE table_name

In [22]:
%sql select * from users;

 * sqlite:///test.db
Done.

[]

In [23]:
%%sql 
INSERT INTO users VALUES (1,'Joe','test@test.com','123#413s',False);
INSERT INTO users VALUES (2, 'Chandler','test@jane.com','21wdds2',True);

 * sqlite:///test.db
1 rows affected.
1 rows affected.

[]

In [24]:
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[(1, 'Joe', 'test@test.com', '123#413s', 0),
 (2, 'Chandler', 'test@jane.com', '21wdds2', 1)]

In [25]:
%sql DELETE FROM users;

 * sqlite:///test.db
2 rows affected.

[]

In [26]:
%sql SELECT * FROM users;

 * sqlite:///test.db
Done.

[]

# Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example.

## Answer : DML stands for "Data Manipulation Language," and it is a subset of SQL (Structured Query Language) that is used to manipulate data within a database. The three main commands in DML are INSERT, UPDATE, and DELETE.

### Creating a Blank Table first with student information grades

In [34]:
%%sql
CREATE TABLE if not exists students
(name VARCHAR(50) ,
age INT ,
grade VARCHAR(2));

 * sqlite:///test.db
Done.

[]

In [35]:
# Viewing the students table
%sql SELECT * FROM students

 * sqlite:///test.db
Done.

[]

1. INSERT - The INSERT command is used to add new data to a database table.

In [36]:
#INSERT Command
%sql INSERT INTO students VALUES ('Neeraj prasad', 28, 'B');

 * sqlite:///test.db
1 rows affected.

[]

In [37]:
# Viewing the table now
%sql SELECT * FROM students

 * sqlite:///test.db
Done.

[('Neeraj prasad', 28, 'B')]

2. UPDATE: The UPDATE command is used to modify existing data in a database table

In [40]:
# UPDATE example
%sql UPDATE students SET grade = 'A+' WHERE name = 'Neeraj prasad';

 * sqlite:///test.db
1 rows affected.

[]

In [41]:
%sql SELECT * FROM students;

 * sqlite:///test.db
Done.

[('Neeraj prasad', 28, 'A+')]

3. DELETE: The DELETE command is used to remove data from a database table.

In [42]:
%sql DELETE FROM students WHERE name='Neeraj prasad';

 * sqlite:///test.db
1 rows affected.

[]

In [43]:
%sql SELECT * FROM students;

 * sqlite:///test.db
Done.

[]

# Q4. What is DQL? Explain SELECT with an example.

## Answer : DQL stands for "Data Query Language," and it is a subset of SQL (Structured Query Language) that is used to retrieve data from a database. The main command in DQL is SELECT.

In [44]:
#Checking students table
%sql SELECt * FROM students

 * sqlite:///test.db
Done.

[]

### Inserting various students using INSERT command

In [45]:
%%sql
INSERT INTO students VALUES ('Neeraj', 28, 'A');
INSERT INTO students VALUES ('John', 35, 'B');
INSERT INTO students VALUES ('Joe', 40, 'A');
INSERT INTO students VALUES ('Chandler', 35, 'A');
INSERT INTO students VALUES ('Diksha', 24, 'C');
INSERT INTO students VALUES ('Aditi', 22, 'B');
INSERT INTO students VALUES ('Kritika', 38, 'C')

 * sqlite:///test.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [46]:
# Selecting Entire students table
%sql SELECT * from students;

 * sqlite:///test.db
Done.

[('Neeraj', 28, 'A'),
 ('John', 35, 'B'),
 ('Joe', 40, 'A'),
 ('Chandler', 35, 'A'),
 ('Diksha', 24, 'C'),
 ('Aditi', 22, 'B'),
 ('Kritika', 38, 'C')]

In [47]:
# Example 2 : Show only name and age of students
%sql SELECT name, age FROM students;

 * sqlite:///test.db
Done.

[('Neeraj', 28),
 ('John', 35),
 ('Joe', 40),
 ('Chandler', 35),
 ('Diksha', 24),
 ('Aditi', 22),
 ('Kritika', 38)]

In [48]:
# Example 3: Selecting student with A Grade
%sql SELECT * FROM students WHERE grade='A';

 * sqlite:///test.db
Done.

[('Neeraj', 28, 'A'), ('Joe', 40, 'A'), ('Chandler', 35, 'A')]

# Q5. Explain Primary Key and Foreign Key.

## Answer: 

1. Primary Key: In a database table, a primary key is a column or a set of columns that uniquely identifies each row in the table. The primary key is used to ensure that each row in the table is unique, and it is often used as a reference by other tables. The primary key is also used to enforce data integrity, which means that it ensures that there are no duplicate or null values in the key column(s).

Creating a table named "customers" with columns "customer_id", "first_name", "last_name", and "email". The "customer_id" column is defined as the primary key.

In [49]:
%%sql
CREATE TABLE customers (
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  email VARCHAR(100));

 * sqlite:///test.db
Done.

[]

In [50]:
%sql SELECT * FROM customers

 * sqlite:///test.db
Done.

[]

2. Foreign Key: A foreign key is a column or a set of columns in a table that refers to the primary key of another table. The foreign key is used to establish a relationship between two tables, and it ensures that the data in the foreign key column(s) of one table matches the data in the primary key column(s) of the other table.

Creating a table named "orders" with columns "order_id", "order_date", "customer_id", and "total_amount". The "order_id" column is defined as the primary key, and the "customer_id" column is defined as a foreign key that references the "customer_id" column of the "customers" table. This establishes a relationship between the "orders" table and the "customers" table. The "total_amount" column is used to store the total amount of the order.

In [51]:
%%sql
CREATE TABLE orders (
  order_id INT PRIMARY KEY,
  order_date DATE,
  customer_id INT,
  total_amount DECIMAL(10,2),
  FOREIGN KEY (customer_id) REFERENCES customers(customer_id));

 * sqlite:///test.db
Done.

[]

In [52]:
%sql SELECT * FROM orders

 * sqlite:///test.db
Done.

[]

### Closing SQLite datbase connection

In [53]:
con.close()

# Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

In [57]:
import mysql.connector
# import mysql.connector
#create user 'user'@'%' identified by 'password'
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="admin"
)
print(mydb)
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)
mydb.close()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000022E1A652B90>
('information_schema',)
('my',)
('mydb',)
('mysql',)
('performance_schema',)
('sales',)
('sys',)

1. In above code, we first establish a connection to a MySQL database using the mysql.connector.connect() method, which takes the host, user, password as arguments.
2. Next, we create a cursor object using the cursor() method of the connection object. The cursor object allows us to execute queries and fetch results.
3. We then execute a SQL query using the execute() method of the cursor object, which takes the SQL query as an argument.

# Q7. Give the order of execution of SQL clauses in an SQL query.

## Answer: In an SQL query, the clauses are executed in the following order:
1. FROM clause: Specifies the table or tables from which to retrieve data.

2. JOIN clause: Specifies how to join multiple tables together, if needed.

3. WHERE clause: Specifies which rows to retrieve based on a set of conditions.

4. GROUP BY clause: Specifies how to group rows based on one or more columns.

5. HAVING clause: Specifies which groups to retrieve based on a set of conditions.

6. SELECT clause: Specifies which columns to retrieve.

7. DISTINCT clause: Specifies to retrieve only distinct values of the specified columns.

8. ORDER BY clause: Specifies how to sort the retrieved rows based on one or more columns.

9. LIMIT clause: Specifies the maximum number of rows to retrieve.